# 4.7 Операции над матрицами в математике
## [Сложение матриц](https://stepik.org/lesson/416756/step/9?auth=registration&unit=406264)
### Задание
Напишите программу для вычисления суммы двух матриц.

**Формат входных данных**  
На вход программе подаются два натуральных числа n и m — количество строк и столбцов в матрицах, затем элементы первой матрицы, затем пустая строка, далее следуют элементы второй матрицы.

**Формат выходных данных**  
Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

### Решение
```python
def read_matrix(n, m):
    matrix = []
    for _ in range(n):
        line = [int(j) for j in input().split()]
        matrix.append(line)
    return matrix

def print_matrix(matrix):
    for line in matrix:
        for col in line:
            print(col, end=" ")
        print()

def matrix_sum(matrix1, matrix2):
    n = len(matrix1)
    m = len(matrix1[0])

    result = []
    for i in range(n):
        line = []
        for j in range(m):
            line.append(matrix1[i][j] + matrix2[i][j])
        result.append(line)

    return result

nm = [int(i) for i in input().split()]
matrix1 = read_matrix(nm[0], nm[1])
input()
matrix2 = read_matrix(nm[0], nm[1])
matrix_result = matrix_sum(matrix1, matrix2)
print_matrix(matrix_result)
```

## [Умножение матриц 🌶️](https://stepik.org/lesson/416756/step/10?auth=registration&unit=406264)
### Задание
Напишите программу, которая перемножает две матрицы.

**Формат входных данных**  
На вход программе подаются два натуральных числа nn и m — количество строк и столбцов в первой матрице, затем элементы первой матрицы, затем пустая строка. Далее следуют числа m и k — количество строк и столбцов второй матрицы затем элементы второй матрицы.

**Формат выходных данных**  
Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

### Решение
```python
def read_matrix(n, m):
    matrix = []
    for _ in range(n):
        line = [int(j) for j in input().split()]
        matrix.append(line)
    return matrix

def print_matrix(matrix):
    for line in matrix:
        for col in line:
            print(col, end=" ")
        print()

def matrix_mult(matrix1, matrix2):
    n = len(matrix1)
    m = len(matrix2[0])

    _k = len(matrix2)

    result = []

    for i in range(n):
        line = []
        for j in range(m):
            sum = 0
            for k in range(_k):
                sum += matrix1[i][k] * matrix2[k][j]
            line.append(sum)
        result.append(line)
    return result

nm1 = [int(i) for i in input().split()]
matrix1 = read_matrix(nm1[0], nm1[1])
input()
nm2 = [int(i) for i in input().split()]
matrix2 = read_matrix(nm2[0], nm2[1])
matirix_result = matrix_mult(matrix1, matrix2)
print_matrix(matirix_result)
```

## [Возведение матрицы в степень 🌶️](https://stepik.org/lesson/416756/step/11?auth=registration&unit=406264)
### Задание
Напишите программу, которая возводит квадратную матрицу в m-ую степень.

**Формат входных данных**  
На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы, затем натуральное число m.

**Формат выходных данных**  
Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

### Решение
```python
def read_matrix(n, m):
    matrix = []
    for _ in range(n):
        line = [int(j) for j in input().split()]
        matrix.append(line)
    return matrix

def print_matrix(matrix):
    for line in matrix:
        for col in line:
            print(col, end=" ")
        print()

def matrix_mult(matrix1, matrix2):
    n = len(matrix1)
    m = len(matrix2[0])

    _k = len(matrix2)

    result = []

    for i in range(n):
        line = []
        for j in range(m):
            sum = 0
            for k in range(_k):
                sum += matrix1[i][k] * matrix2[k][j]
            line.append(sum)
        result.append(line)
    return result

def matrix_rank(matrix, rank):
    matrix2 = matrix.copy()
    for i in range(rank - 1):
        matrix2 = matrix_mult(matrix2, matrix)
    return matrix2

n = int(input())
matrix1 = read_matrix(n, n)
m = int(input())

result = matrix_rank(matrix1, m)
print_matrix(result)
```