# 6.3 Основы работы с кортежами. Часть 2
## [-](https://stepik.org/lesson/443990/step/4?unit=434154)
### Задание
Дополните приведенный код так, чтобы он вывел **произведение элементов** кортежа `numbers`.

### Решение
```python
numbers = (2, 3, 5, 7, -11, 13, 17, 19, 23, 29, 31, -6, 41, 43, 47, 53, 59, 61, -96, 71, 1000, -1)
mult = 1
for num in numbers:
    mult *= num
print(mult)
```

## [-](https://stepik.org/lesson/443990/step/5?unit=434154)
### Задание
Дополните приведенный код так, чтобы он преобразовал строку в кортеж символов строки и вывел результат.

### Решение
```python
data = 'Python для продвинутых!'
print(tuple(data))
```

## [-](https://stepik.org/lesson/443990/step/6?unit=434154)
### Задание
Программист Тимур написал программу для работы с биографическими данными русских поэтов. Данные содержатся в кортежах вида `(фамилия, год рождения, город рождения).` В процессе работы программы в некотором кортеже `poet_data` обнаружилась ошибка: `('Пушкин', 1799, 'Санкт-Петербург')`, неверно указано место рождения, ведь Александр Пушкин родился в Москве.

Дополните приведенный код так, чтобы в переменной `poet_data` находился правильный кортеж (с исправленным значением), а затем выведите его содержимое.

### Решение
```python
poet_data = ('Пушкин', 1799, 'Санкт-Петербург')

list = list(poet_data)
list[2] = "Москва"
poet_data = tuple(list)

print(poet_data)
```

## [-](https://stepik.org/lesson/443990/step/7?unit=434154)
### Задание
Дополните приведенный код так, чтобы он вывел список, содержащий средние арифметические значения чисел каждого вложенного кортежа в заданном кортеже кортежей `numbers`.

### Решение
```python
numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))
print([sum(i) / len(i) for i in numbers])
```

## [Вершина параболы](https://stepik.org/lesson/443990/step/8?unit=434154)
### Задание
## Вершина параболы
Уравнение параболы имеет вид y =ax^2 + bx + c, где a=0. Напишите программу, которая по введенным значениям a, b, c определяет и выводит вершину параболы.

**Формат входных данных**  
На вход программе подаются три целых числа, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести координаты вершины параболы.

### Решение
```python
def get_vertex(a, b, c):
    return -b/(2*a), (4 * a * c - b ** 2) / (4 * a)

a, b, c = int(input()), int(input()), int(input())
print(get_vertex(a, b, c))
```

## [Конкурсный отбор](https://stepik.org/lesson/443990/step/9?unit=434154)
### Задание
Напишите программу, которая выводит список хорошистов и отличников в классе.

**Формат входных данных**  
На вход программе подается натуральное число n, далее следует n строк с фамилией школьника и его оценкой на каждой из них.

**Формат выходных данных**  
Программа должна вывести сначала все введённые строки с фамилиями и оценками учеников в том же порядке. Затем следует пустая строка, а затем выводятся строки с фамилиями и оценками хорошистов и отличников (в том же порядке).

**Примечание 1.** Оценка ученика – это натуральное число от 1 до 5.

**Примечание 2.** Гарантируется, что в классе есть хотя бы один хорошист – обладатель оценки 4, или отличник – получивший 5.

### Решение
```python
n = int(input())
students = [tuple(input().split()) for _ in range(n)]

for i in students:
    print(i[0], i[1])
print()
for i in students:
    if (int(i[1]) >= 4):
        print(i[0], i[1])
```

## [Последовательность Трибоначчи](https://stepik.org/lesson/443990/step/15?unit=434154)
### Задание
Напишите программу, которая считывает натуральное число n и выводит первые n чисел последовательности Трибоначчи.

**Формат входных данных**  
На вход программе подается одно число n (n≤100) – количество членов последовательности.

**Формат выходных данных**  
Программа должна вывести члены последовательности Трибоначчи, отделенные символом пробела.

**Примечание.** Последовательность Трибоначчи – последовательность натуральных чисел, где каждое последующее число является суммой трех предыдущих:
1, 1, 1, 3, 5, 9, 17, 31, 57, 105 …

### Решение
```python
n = int(input())
t1, t2, t3= 1, 1, 1
for i in range(n):
    print(t1, end=" ")
    t1, t2, t3 = t2, t3, t1 + t2 + t3
```