# 8.4 Основы работы с множествами
## [-](https://stepik.org/lesson/481525/step/6?unit=472630)
### Задание
Дополните приведенный код так, чтобы он вывел сумму минимального и максимального элементов множества `numbers`.

### Решение
```python
numbers = {1.414, 12.5, 3.1415, 2.718, 9.8, 1.414, 1.1618, 1.324, 2.718, 1.324}
print(min(numbers) + max(numbers))
```

## [-](https://stepik.org/lesson/481525/step/7?unit=472630)
### Задание
Дополните приведенный код, чтобы он вывел среднее арифметическое элементов множества `numbers`.

### Решение
```python
numbers = {20, 6, 8, 18, 18, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 12, 8, 8, 10, 4, 2, 2, 2, 16, 20}
average = sum(numbers) / len(numbers)
print(average)
```

## [-](https://stepik.org/lesson/481525/step/10?unit=472630)
### Задание
Дополните приведенный код, чтобы он вывел сумму квадратов элементов множества `numbers`.
### Решение
```python
numbers = {9089, -67, -32, 1, 78, 23, -65, 99, 9089, 34, -32, 0, -67, 1, 11, 111, 111, 1, 23}
result = 0
for n in numbers:
    result += n ** 2
print(result)
```

## [-](https://stepik.org/lesson/481525/step/11?unit=472630)
### Задание
Дополните приведенный код, чтобы он вывел элементы множества `fruits`, каждый на отдельной строке, отсортированные по убыванию (в обратном лексикографическом порядке).

### Решение
```python
fruits = {'apple', 'banana', 'cherry', 'avocado', 'pineapple', 'apricot', 'banana', 'avocado', 'grapefruit'}
print(*sorted(fruits, reverse=True), sep="\n")
```

## [Количество различных символов](https://stepik.org/lesson/481525/step/12?unit=472630)
### Задание
На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в строке.

**Формат входных данных**  
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести количество различных символов в строке.

**Примечание.** Задачу можно решить в одну строчку кода.

### Решение
```python
print(len(set(input())))
```

## [Неповторимые цифры](https://stepik.org/lesson/481525/step/13?unit=472630)
### Задание
На вход программе подается строка, состоящая из цифр. Необходимо определить, верно ли, что в ее записи ни одна из цифр не повторяется?

**Формат входных данных**  
На вход программе подается строка, состоящая из цифр

**Формат выходных данных**  
Программа должна вывести `YES` если ни одна из цифр в строке не повторяется и `NO` в противном случае.

### Решение
```python
str = input()
if (len(str) == len(set(str))):
    print("YES")
else:
    print("NO")
```

## [Все 10 цифр](https://stepik.org/lesson/481525/step/14?unit=472630)
### Задание
На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли, что в записи этих двух строк используются все десять цифр?

**Формат входных данных**  
На вход подаются две строки, состоящие из цифр.

**Формат выходных данных**  
Программа должна вывести `YES`, если в записи этих двух строк используются все десять цифр, и `NO` в противном случае.

### Решение
```python
ten_set = set([str(i) for i in range(10)])
input_str = set(input() + input())

if (ten_set == input_str):
    print("YES")
else:
    print("NO")
```

## [Одинаковые наборы](https://stepik.org/lesson/481525/step/15?unit=472630)
### Задание
На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли, что для записи этих строк были использованы одинаковые наборы цифр?

**Формат входных данных**  
На вход подаются две строки, состоящие из цифр.

**Формат выходных данных**  
Программа должна вывести `YES`, если для записи этих строк были использованы одинаковые наборы цифр и `NO`, в противном случае.

### Решение
```python
print(["NO", "YES"][set(input()) == set(input())])
```

## [Три слова](https://stepik.org/lesson/481525/step/16?unit=472630)
### Задание
На вход программе подается строка, состоящая из трех слов. Верно ли, что для записи всех трех слов был использован один и тот же набор букв?

Формат входных данных
На вход программе подается строка, состоящая из трех слов.

Формат выходных данных
Программа должна вывести YES, если для записи всех трех слов был использован один и тот же набор букв и NO в противном случае.

### Решение
```python
words = [set(i) for i in input().split()]
print(["NO", "YES"][words[0] == words[1] == words[2]])
```
