# 8.5 Методы множеств. Часть 1
## [Уникальные символы 1](https://stepik.org/lesson/445791/step/11?unit=436052)
### Задание
Напишите программу для вывода количества уникальных символов каждого считанного слова без учета регистра.

**Формат входных данных**  
На вход программе в первой строке подается число n – общее количество слов. Далее идут n строк с словами.

**Формат выходных данных**  
Программа должна вывести на отдельной строке количество уникальных символов для каждого слова.

### Решение
```python
n = int(input())
print(*[len(set(input().lower())) for i in range(n)], sep="\n")
```

## [Уникальные символы 2](https://stepik.org/lesson/445791/step/12?unit=436052)
### Задание
Напишите программу для вывода общего количества уникальных символов во всех считанных словах без учета регистра.

**Формат входных данных**  
На вход программе в первой строке подается число n – общее количество слов. Далее идут nn строк с словами.

**Формат выходных данных**  
Программа должна вывести одно число – общее количество уникальных символов во всех словах без учета регистра.

### Решение
```python
n = int(input())
print(len(set("".join([input().lower() for _ in range(n)]))))
```

## [Количество слов в тексте](https://stepik.org/lesson/445791/step/13?unit=436052)
### Задание
Напишите программу для определения общего количества различных слов в строке текста.

Формат входных данных
На вход программе подается строка текста.

Формат выходных данных
Программа должна вывести одно число – общее количество различных слов в строке без учета регистра.

Примечание 1. Словом считается последовательность непробельных символов, идущих подряд, слова разделены одним или большим числом пробелов.

Примечание 2. Знаками препинания .,;:-?! пренебрегаем.

### Решение
```python
sybs = ".,;:-?!"
str = input().lower()

for i in sybs:
    if i in str:
        str = str.replace(i, "")

print(len(set(str.split())))
```

## [Встречалось ли число раньше?](https://stepik.org/lesson/445791/step/14?unit=436052)
### Задание
На вход программе подается строка текста, содержащая числа. Для каждого числа выведите слово `YES` (в отдельной строке), если это число ранее встречалось в последовательности или `NO`, если не встречалось.

**Формат входных данных**  
На вход программе подается строка текста, содержащая числа, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

**Примечание.** Ведущие нули в числах должны игнорироваться.

### Решение
```python
numbers = [int(i) for i in input().split()]
number_set = set()

for n in numbers:
    print(["NO", "YES"][n in number_set])
    if n not in number_set:
        number_set.add(n)
```
