# 8.6 Методы множеств. Часть 2
## [Количество совпадающих](https://stepik.org/lesson/482377/step/13?unit=473680)
### Задание
На вход программе подаются две строки текста, содержащие числа. Напишите программу, которая определяет количество чисел, которые есть как в первой строке, так и во второй.

**Формат входных данных**  
На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести количество чисел, содержащихся одновременно как в первой строке, так и во второй.

### Решение
```python
set1 = set(input().split())
set2 = set(input().split())

print(len(set1 & set2))
```

## [Общие числа](https://stepik.org/lesson/482377/step/14?unit=473680)
### Задание
На вход программе подаются две строки текста, содержащие числа. Напишите программу, которая выводит все числа в порядке возрастания, которые есть как в первой строке, так и во второй.

Формат входных данных
На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.

Формат выходных данных
Программа должна вывести множество чисел, встречающихся в обеих строках.

### Решение
```python
set1 = set([int(i) for i in input().split()])
set2 = set([int(i) for i in input().split()])

print(*sorted(set1 & set2))
```

## [Числа первой строки](https://stepik.org/lesson/482377/step/15?unit=473680)
### Задание
На вход программе подаются две строки текста, содержащие числа. Напишите программу, которая выводит все числа в порядке возрастания, которые есть в первой строке, но отсутствуют во второй.

**Формат входных данных**  
На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести множество чисел, встречающихся только в первой строке.

### Решение
```python
set1 = set([int(i) for i in input().split()])
set2 = set([int(i) for i in input().split()])

print(*sorted(set1 - set2))
```

## [Общие цифры](https://stepik.org/lesson/482377/step/16?unit=473680)
### Задание
На вход программе подается натуральное число n, а затем nn различных натуральных чисел, каждое на отдельной строке. Напишите программу, которая выводит все общие цифры в порядке возрастания у всех введенных чисел.

Формат входных данных
На вход программе подаются натуральное число n≥1, а затем n различных натуральных чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести цифры в соответствии с условием задачи. Если общих цифр нет, то ничего выводить не нужно.

### Решение
```python
n = int(input())
result_set = set(input())

for i in range(n - 1):
    result_set.intersection_update(input())

print(*sorted(result_set))
```