# 8.7 Методы множеств. Часть 3
## [Одинаковые цифры](https://stepik.org/lesson/483114/step/8?unit=474427)
### Задание
На вход программе подаются два числа. Напишите программу, определяющую, есть ли в данных числах одинаковые цифры.

Формат входных данных
На вход программе подаются два натуральных числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести YES, если в записи данных чисел есть одинаковые цифры и NO если нет.

### Решение
```python
print(["YES", "NO"][set(input()).isdisjoint(input())])
```

## [Все цифры](https://stepik.org/lesson/483114/step/9?unit=474427)
### Задание
На вход программе подаются два числа. Напишите программу, которая определяет, входят ли в запись первого числа все цифры, содержащиеся в записи второго (независимо от повтора, то есть количества цифр) числа или нет.

**Формат входных данных**  
На вход программе подаются два натуральных числа, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести `YES`, если в запись первого числа входят все цифры, содержащиеся в записи второго числа и `NO` в противном случае.

### Решение
```python
print(["NO", "YES"][set(input()) >= set(input())])
```

## [Урок информатики](https://stepik.org/lesson/483114/step/10?unit=474427)
### Задание
Даны по 10-балльной шкале оценки по информатике трех учеников. Напишите программу, которая выводит множество оценок, которые есть и у первого и у второго учеников, но которых нет у третьего ученика.

Формат входных данных
На вход программе подаются оценки трех учеников, разделенные символом пробела (оценки каждого ученика на отдельной строке).

Формат выходных данных
Программа должна вывести множество оценок в порядке убывания на одной строке, разделенных пробелами, в соответствии с условием задачи.

### Решение
```python
def get_number_set_from_str(str: str):
    return set([int(i) for i in str.split()])

print(*sorted(get_number_set_from_str(input()) & get_number_set_from_str(input()) - get_number_set_from_str(input()), reverse=True))
```

## [Урок математики](https://stepik.org/lesson/483114/step/11?unit=474427)
### Задание
Даны по 10-балльной шкале оценки по математике трех учеников. Напишите программу, которая выводит множество оценок, имеющихся у учеников, которые встречаются не более, чем у двух из указанных учеников.

Формат входных данных
На вход программе подаются оценки трех учеников, разделенные символом пробела (оценки каждого ученика на отдельной строке).

Формат выходных данных
Программа должна вывести множество оценок в порядке возрастания на одной строке, разделенных пробелами, в соответствии с условием задачи.

Примечание. Оценка ученика находится в диапазоне от 0 до 10 включительно.

### Решение
```python
def get_number_set_from_str(str: str):
    return set([int(i) for i in str.split()])

set1 = get_number_set_from_str(input())
set2 = get_number_set_from_str(input())
set3 = get_number_set_from_str(input())

print(*sorted((set1 | set2 | set3) - (set1 & set2 & set3)))
```

## [Урок физики](https://stepik.org/lesson/483114/step/12?unit=474427)
### Задание
Даны по 10-балльной шкале оценки по физике трех учеников. Напишите программу, которая выводит множество оценок третьего ученика, которые не встречаются ни у первого, ни у второго ученика.

Формат входных данных
На вход программе подаются оценки трех учеников, разделенные символом пробела (оценки каждого ученика на отдельной строке).

Формат выходных данных
Программа должна вывести множество оценок в порядке убывания на одной строке, разделенных пробелами, в соответствии с условием задачи.

Примечание. Оценка ученика находится в диапазоне от 0 до 10 включительно.

### Решение
```python
def get_number_set_from_str(str: str):
    return set([int(i) for i in str.split()])

set1 = get_number_set_from_str(input())
set2 = get_number_set_from_str(input())
set3 = get_number_set_from_str(input())

print(*sorted(set3 - (set1 | set2), reverse=True))
```

## [Урок биологии](https://stepik.org/lesson/483114/step/13?unit=474427)
### Задание
Даны по 10-балльной шкале оценки по биологии трех учеников. Напишите программу, которая выводит множество оценок, не встречающихся ни у одного из трех учеников.

**Формат входных данных**  
На вход программе подаются оценки трех учеников, разделенные символом пробела (оценки каждого ученика на отдельной строке).

**Формат выходных данных**  
Программа должна вывести множество оценок **в порядке возрастания** на одной строке, разделенных пробелами, в соответствии с условием задачи.

**Примечание.** Оценка ученика находится в диапазоне от 0 до 10 включительно.

### Решение
```python
def get_number_set_from_str(str: str):
    return set([int(i) for i in str.split()])

set1 = get_number_set_from_str(input())
set2 = get_number_set_from_str(input())
set3 = get_number_set_from_str(input())

set4 = set(range(11))

print(*sorted(set4 - (set1 | set2 | set3)))
```