# 10.4 Задачи на словари
## [Словарь программиста](https://stepik.org/lesson/488831/step/1?unit=480067)
### Задание
Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма специфический язык. Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы придумали эту задачу. Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она потом по запросу возвращала значения из этого словаря.

Формат входных данных
В первой строке задано одно целое число nn — количество слов в словаре. В следующих nn строках записаны слова и их определения, разделенные двоеточием и символом пробела. В следующей строке записано целое число mm — количество поисковых слов, чье определение нужно вывести. В следующих mm строках записаны сами слова, по одному на строке.

Формат выходных данных
Для каждого слова, независимо от регистра символов, если оно присутствует в словаре, необходимо вывести его определение. Если слова в словаре нет, программа должна вывести "Не найдено", без кавычек.

Примечание 1. Мини-словарь для начинающих разработчиков можно посмотреть тут.

Примечание 2. Гарантируется, что в определяемом слове или фразе отсутствует двоеточие (:), следом за которым идёт пробел.

### Решение
```python
words = {}
n = int(input())

for _ in range(n):
    string = input().split(": ")
    words[string[0].lower()] = string[1]

j = int(input())
result = []
for _ in range(j):
    word = input().lower()
    result.append(words.get(word, "Не найдено"))

print(*result, sep="\n")
```

## [Анаграммы 1](https://stepik.org/lesson/488831/step/2?unit=480067)
### Задание
Анаграмма – слово (словосочетание), образованное путём перестановки букв, составляющих другое слово (или словосочетание). Например, английские слова evil и live – это анаграммы.

На вход программе подаются два слова. Напишите программу, которая определяет, являются ли они анаграммами.

Формат входных данных
На вход программе подаются два слова, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести YES если слова являются анаграммами и NO в противном случае.

### Решение
```python
def createDictFromString(string: str):
    result = {}
    for c in string:
        result[c] = result.get(c, 0) + 1
    return result


d1 = createDictFromString(input())
d2 = createDictFromString(input())
print(["NO", "YES"][d1 == d2])
```

## [Анаграммы 2](https://stepik.org/lesson/488831/step/3?unit=480067)
### Задание
На вход программе подаются два предложения. Напишите программу, которая определяет, являются они анаграммами или нет. Ваша программа должна игнорировать регистр символов, знаки препинания и пробелы.

Формат входных данных
На вход программе подаются два предложения, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести YES , если предложения – анаграммы и NO в противном случае.

Примечание. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-. Других символов в тексте нет.

### Решение
```python
def createDictFromString(string: str):
    replased_sybs = ".,!?:;- "
    for syb in replased_sybs:
        string = string.replace(syb, "")
    string = string.upper()

    result = {}
    for c in string:
        result[c] = result.get(c, 0) + 1
    return result

d1 = createDictFromString(input())
d2 = createDictFromString(input())

print(["NO", "YES"][d1 == d2])
```

## [Словарь синонимов](https://stepik.org/lesson/488831/step/4?unit=480067)
### Задание
Вам дан словарь, состоящий из пар слов-синонимов. Повторяющихся слов в словаре нет. Напишите программу, которая для одного данного слова определяет его синоним.

Формат входных данных
На вход программе подается количество пар синонимов n. Далее следует n строк, каждая строка содержит два слова-синонима. После этого следует одно слово, синоним которого надо найти.

Формат выходных данных
Программа должна вывести одно слово, синоним введенного.

Примечание 1. Гарантируется, что синоним введенного слова существует в словаре.

Примечание 2. Все слова в словаре начинаются с заглавной буквы.

### Решение
```python
n = int(input())
result = {}

for i in range(n):
    a, b = input().split()
    result[a], result[b] = b, a

word = input()
print(result.get(word))
```

## [Страны и города](https://stepik.org/lesson/488831/step/5?unit=480067)
### Задание
На вход программе подается список стран и городов каждой страны. Затем даны названия городов. Напишите программу, которая для каждого города выводит, в какой стране он находится.

Формат входных данных
Программа получает на вход количество стран n. Далее идет n строк, каждая строка начинается с названия страны, затем идут названия городов этой страны. В следующей строке записано число m, далее идут m запросов — названия каких-то m городов, из перечисленных выше.

Формат выходных данных
Программа должна вывести название страны, в которой находится данный город в соответствии с примером.

### Решение
```python
n = int(input())

d = {}
for i in range(n):
    words = input().split()
    d.update(dict.fromkeys(words[1:], words[0])) #d |= dict.fromkeys(words[1:], words[0])

n = int(input())
result = []
for i in range(n):
    city = input()
    result.append(d[city])

print(*result, sep='\n')
```

## [Телефонная книга](https://stepik.org/lesson/488831/step/6?unit=480067)
### Задание
Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.

У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.

Формат входных данных
В первой строке задано одно целое число nn — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. В следующих nn строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число mm — количество поисковых запросов от Тимура. В следующих mm строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.

Формат выходных данных
Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).

Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.

Примечание 2. Количество строк в ответе должно быть равно числу mm.

Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.

### Решение
```python
n = int(input())

d = {}
for _ in range(n):
    string = input().upper().split()
    key = d.setdefault(string[1], [])
    key.append(string[0])

n = int(input())
result = []
for _ in range(n):
    string = input().upper()
    result.append(d.get(string, ["абонент не найден"]))

for r in result:
    print(*r)
```

## [Секретное слово](https://stepik.org/lesson/488831/step/7?unit=480067)
### Задание
Напишите программу для расшифровки секретного слова методом частотного анализа.

Формат входных данных
В первой строке задано зашифрованное слово. Во второй строке задано одно целое число n – количество букв в словаре. В следующих n строках записано, сколько раз конкретная буква алфавита встречается в этом слове – <буква>: <частота>.

Формат выходных данных
Программа должна вывести дешифрованное слово.

Примечание. Гарантируется, что частоты букв не повторяются.

### Решение
```python
secret = input()
ds = {}
for s in secret:
    count = secret.count(s)
    if s not in ds:
        ds[s] = count

d = {}
for _ in range(int(input())):
    syb, count = input().split(": ")
    if int(count) not in d:
        d[int(count)] = syb

result = ""
for s in secret:
    result += d[ds[s]]
print(result)
```