# 12.1 Модуль random. Часть 1
## [-](https://stepik.org/lesson/356379/step/11?unit=340494)
### Задание
Напишите программу, которая с помощью модуля `random` моделирует броски монеты. Программа принимает на вход количество попыток и выводит результаты бросков: `Орел` или `Решка` (каждое на отдельной строке).

### Решение
```python
import random

def coin_chanse():
    return ["Орел", "Решка"][random.randint(0, 1)]

n = int(input())    # количество попыток
for i in range(n):
    print(coin_chanse())
```

## [-](https://stepik.org/lesson/356379/step/12?unit=340494)
### Задание
Напишите программу, которая с помощью модуля `random` моделирует броски игрального кубика c 66 гранями. Программа принимает на вход количество попыток и выводит результаты бросков — выпавшее число, которое написано на грани кубика (каждое на отдельной строке).

### Решение
```python
import random

def dice_chance():
    return random.randint(1, 6)

n = int(input())    # количество попыток
for i in range(n):
    print(dice_chance())
```

## []()
### Задание
Напишите программу, которая с помощью модуля `random` генерирует случайный пароль. Программа принимает на вход длину пароля и выводит случайный пароль, содержащий **только** символы английского алфавита `a..z, A..Z` (в нижнем и верхнем регистре).

**Примечание 1.** Символам `A..Z` английского языка соответствуют номера с 65 по 90 в таблице символов ASCII.

**Примечание 2.** Символам `a..z` английского языка соответствуют номера с 97 по 122 в таблице символов ASCII.

**Примечание 3.** Используйте функцию `chr()` для получения символа по его номеру в таблице символов ASCII.

 **Примечание 4.** Например, при длине пароля, равной 15 символам ваша программа может выводить:

```no-highlight
peJFAmhqfaAeKDu
```

### Решение
```python
import random

def generate_pass(size):
    sybs = [chr(i) for i in range(65, 91)] + [chr(i) for i in range(97, 123)]  
    result = random.choices(sybs, k=size)
    return "".join(result)

length = int(input())    # длина пароля
print(generate_pass(length))
```

## [-](https://stepik.org/lesson/356379/step/14?unit=340494)
### Задание
Лотерейный билет содержит 7 чисел из диапазона от 1 до 49 (включительно).

Напишите программу, которая с помощью модуля random генерирует 7 различных случайных чисел для лотерейного билета. Программа должна вывести числа в порядке возрастания на одной строке через один символ пробела.

Примечание. Убедитесь, что сгенерированные числа не содержат дубликатов.

### Решение
```python
import random

def generate_ticket():
    result = set()
    while(len(result) != 7):
        result.add(random.randint(1, 49))
    return result

print(*sorted(generate_ticket()), sep=" ")
```

