# 13.1 Модуль decimal
## [-](https://stepik.org/lesson/360941/step/10?unit=345464)
### Задание
Decimal числа, разделенные символом пробела, хранятся в строковой переменной s. Дополните приведенный код, чтобы он вывел сумму наибольшего и наименьшего Decimal числа.

### Решение
```python
from decimal import Decimal
s = '0.77 4.03 9.06 3.80 7.08 5.88 0.23 4.65 2.79 0.90 4.23 2.15 3.24 8.57 0.10 8.57 1.49 5.64 3.63 8.36 1.56 6.67 1.46 5.26 4.83 7.23 1.22 1.02 7.82 9.97 5.40 9.79 9.82 2.78 2.96 0.07 1.72 7.24 7.84 9.23 1.71 6.24 5.78 5.37 0.03 9.60 8.86 2.73 5.83 6.50'
numbers = [Decimal(i) for i in s.split()]
print(min(numbers) + max(numbers))
```

## [-](https://stepik.org/lesson/360941/step/11?unit=345464)
### Задание
`Decimal` числа, разделенные символом пробела, хранятся в строковой переменной `s`. Дополните приведенный код, чтобы он вывел на первой строке сумму всех чисел, а на второй строке 5 самых больших чисел в порядке убывания, разделенных символом пробела.

### Решение
```python
from decimal import Decimal
s = '9.73 8.84 8.92 9.60 9.32 8.97 8.53 1.26 6.62 9.85 1.85 1.80 0.83 6.75 9.74 9.11 9.14 5.03 5.03 1.34 3.52 8.09 7.89 8.24 8.23 5.22 0.30 2.59 1.25 6.24 2.14 7.54 5.72 2.75 2.32 2.69 9.32 8.11 4.53 0.80 0.08 9.36 5.22 4.08 3.86 5.56 1.43 8.36 6.29 5.13'
numbers = [Decimal(i) for i in s.split()]
print(sum(numbers))
print(*sorted(numbers, reverse=True)[:5])
```

## [-](https://stepik.org/lesson/360941/step/12?unit=345464)
### Задание
Дополните приведенный код, чтобы он вывел сумму наибольшей и наименьшей цифры Decimal числа.

### Решение
```python
from decimal import *
num = Decimal(input())
digits = num.as_tuple().digits
print([min(digits), 0][-1 <= num <= 1] +  max(digits))
```

## [-](https://stepik.org/lesson/360941/step/13?unit=345464)
### Задание
На вход программе подается `Decimal` число d. Напишите программу, которая вычисляет значение выражения: e^{d} + ln(d) + lg (d) + sqrt{d}

**Формат входных данных**  
На вход программе подается положительное десятичное число d.

**Формат выходных данных**  
Программа должна вывести искомое значение выражения.

### Решение
```python
from decimal import Decimal

number = Decimal(input())
print(number.exp() + number.ln() + number.log10() + number.sqrt())
```
