# 13.2 Модуль fractions
## [-](https://stepik.org/lesson/362369/step/6?unit=346925)
### Задание
Десятичные числа хранятся в списке `numbers` в виде строк. Дополните приведенный код, чтобы он для каждого десятичного числа вывел его представление в виде обыкновенной дроби в формате:

-   десятичное число = обыкновенная дробь

### Решение
```python
from fractions import Fraction

numbers = ['6.34', '4.08', '3.04', '7.49', '4.45', '5.39', '7.82', '2.76', '0.71', '1.97', '2.54', '3.67', '0.14', '4.29', '1.84', '4.07', '7.26', '9.37', '8.11', '4.30', '7.16', '2.46', '1.27', '0.29', '5.12', '4.02', '6.95', '1.62', '2.26', '0.45', '6.91', '7.39', '0.52', '1.88', '8.38', '0.75', '0.32', '4.81', '3.31', '4.63', '7.84', '2.25', '1.10', '3.35', '2.05', '7.87', '2.40', '1.20', '2.58', '2.46']

for n in numbers:
    print(F"{n} = {Fraction(n)}")
```

## [-](https://stepik.org/lesson/362369/step/7?unit=346925)
### Задание
Десятичные числа разделенные символом пробела хранятся в строковой переменной `s`. Дополните приведенный код, чтобы он вывел сумму наибольшего и наименьшего числа в виде обыкновенной дроби.

### Решение
```python
from fractions import Fraction

s = '0.78 4.3 9.6 3.88 7.08 5.88 0.23 4.65 2.79 0.90 4.23 2.15 3.24 8.57 0.10 8.57 1.49 5.64 3.63 8.36 1.56 6.67 1.46 5.26 4.83 7.13 1.22 1.02 7.82 9.97 5.40 9.79 9.82 2.78 2.96 0.07 1.72 7.24 7.84 9.23 1.71 6.24 5.78 5.37 0.03 9.60 8.86 2.73 5.83 6.50 0.123 0.00021'
fractions = [Fraction(i) for i in s.split()]
print(min(fractions) + max(fractions))
```

## [Сократите дробь](https://stepik.org/lesson/362369/step/8?unit=346925)
### Задание
Даны два натуральных числа mm и nn. Напишите программу, которая сокращает дробь n/m и выводит ее.

**Формат входных данных**  
На вход программе подается два натуральных числа, числитель и знаменатель дроби, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести ответ на задачу.

### Решение
```python
from fractions import Fraction
print(Fraction(f"{input()}/{input()}"))
```

## [Операции над дробями](https://stepik.org/lesson/362369/step/9?unit=346925)
### Задание
Даны две дроби в формате `a/b`. Напишите программу, которая вычисляет и выводит их сумму, разность, произведение и частное.

**Формат входных данных**  
На вход программе подаются две ненулевые дроби, каждая на отдельной строке.

**Формат выходных данных**  
Программа должна вывести сумму, разность, произведение и частное двух дробей.

**Примечание.** Обратите внимание на третий тест: исходные дроби сокращать не нужно, а результат нужно.

### Решение
```python
from fractions import Fraction as F

a, b = input(), input()
a_f, b_f = F(a), F(b)

print(f"{a} + {b} = {a_f + b_f}")
print(f"{a} - {b} = {a_f - b_f}")
print(f"{a} * {b} = {a_f * b_f}")
print(f"{a} / {b} = {a_f / b_f}")
```

## [Сумма дробей 1](https://stepik.org/lesson/362369/step/10?unit=346925)
### Задание
На вход программе подается натуральное число nn. Напишите программу, которая вычисляет и выводит рациональное число, равное значению выражения \dfrac{1}{1^2} + \dfrac{1}{2^2} + \dfrac{1}{3^2} + \dfrac{1}{4^2} + \ldots + \dfrac{1}{n^2}

**Формат входных данных**  
На вход программе подается натуральное число nn.

**Формат выходных данных**  
Программа должна вывести ответ на задачу.

### Решение
```python
from fractions import Fraction as F

result = F(0)
for i in range(1, int(input()) + 1):
    tmp = i ** 2
    result += F(1, F(tmp))
print(result)
```

## [Сумма дробей 2](https://stepik.org/lesson/362369/step/11?unit=346925)
### Задание
На вход программе подается натуральное число nn. Напишите программу, которая вычисляет и выводит рациональное число, равное значению выражения \dfrac{1}{1!} + \dfrac{1}{2!} + \dfrac{1}{3!} + \dfrac{1}{4!} + \ldots + \dfrac{1}{n!}

### Решение
```python
from fractions import Fraction as F
from math import factorial

result = F(0)
for i in range(1, int(input()) + 1):
    tmp = factorial(i)
    result += F(1, tmp)
print(result)
```

## [Юный математик 🌶️](https://stepik.org/lesson/362369/step/12?unit=346925)
### Задание
Дима учится в седьмом классе и сейчас они проходят обыкновенные дроби с натуральными числителем и знаменателем. Вчера на уроке математики Дима узнал, что дробь называется правильной, если ее числитель меньше знаменателя, и несократимой, если нет равной ей дроби с меньшими натуральными числителем и знаменателем.

Дима очень любит математику, поэтому дома он долго экспериментировал, придумывая и решая разные задачки с правильными несократимыми дробями. Одну из этих задач Дима предлагает решить вам с помощью компьютера.

На вход программе подается натуральное число nn. Напишите программу, которая находит наибольшую правильную несократимую дробь с суммой числителя и знаменателя равной nn.

Формат входных данных
На вход программе подается натуральное число nn.

Формат выходных данных
Программа должна вывести ответ на задачу.

Примечание. Возможно вам потребуется функция gcd(), которая позволяет находить наибольший общий делитель (НОД) двух чисел. Функция реализована в модуле math.

### Решение
```python
import fractions
from math import gcd

n = int(input())

divisible = 1
divider = n - 1

maxFraction = fractions.Fraction(divisible, divider)

while divisible < divider:
    if gcd(divisible, divider) == 1:
        fraction = fractions.Fraction(divisible, divider)
        if (fraction > maxFraction):
            maxFraction = fraction
    divisible += 1
    divider -= 1

print(maxFraction)
```

## [Упорядоченные дроби](https://stepik.org/lesson/362369/step/13?unit=346925)
### Задание
На вход программе подается натуральное число nn. Напишите программу, которая выводит в порядке возрастания все несократимые дроби, заключённые между 0 и 1, знаменатель которых не превосходит n.

**Формат входных данных**  
На вход программе подается натуральное число n, n>1.

**Формат выходных данных**  
Программа должна вывести ответ на задачу.

### Решение
```python
import fractions
from math import gcd

n = int(input())

divider = n

result = []

while divider != 0:
    divisible = 1
    
    while divisible < divider:
        if gcd(divisible, divider) == 1:
            result.append(fractions.Fraction(divisible, divider))
        divisible += 1

    divider -= 1

print(*sorted(result), sep="\n")

```