# 15.4 Функции как объекты
## [-](https://stepik.org/lesson/508939/step/10?unit=501049)
### Задание
Дан список `numbers`, содержащий кортежи чисел. Напишите программу, которая с помощью встроенных функций `min()` и `max()` выводит те кортежи (каждый на отдельной строке), которые имеют минимальное и максимальное среднее арифметическое значение элементов.

### Решение
```python
def averagetuple(t):
    sum = 0
    count = 0
    for i in t:
        sum += i
        count += 1
    return sum / count

numbers = [(10, 10, 10), (30, 45, 56), (81, 39), (1, 2, 3), (12,), (-2, -4, 100), (1, 2, 99), (89, 9, 34), (10, 20, 30, -2), (50, 40, 50), (34, 78, 65), (-5, 90, -1, -5), (1, 2, 3, 4, 5, 6), (-9, 8, 4), (90, 1, -45, -21)]
print(min(numbers, key=averagetuple))
print(max(numbers, key=averagetuple))
```

## [-](https://stepik.org/lesson/508939/step/11?unit=501049)
### Задание
Напишите программу, которая сортирует список `points` координат точек плоскости в соответствии с расстоянием от начала координат (0;0). Программа должна вывести отсортированный список.

### Решение
```python
def distance(point):
    return (point[0] ** 2 + point[1] ** 2) ** 0.5
 
points = [(-1, 1), (5, 6), (12, 0), (4, 3), (0, 1), (-3, 2), (0, 0), (-1, 3), (2, 0), (3, 0), (-9, 1), (3, 6), (8, 8)]

print(sorted(points, key=distance))
```

## [-](https://stepik.org/lesson/508939/step/12?unit=501049)
### Задание
Дан список `numbers`, содержащий кортежи чисел. Напишите программу, которая сортирует и выводит список `numbers` в соответствии с суммой минимального и максимального элемента кортежа.

**Примечание 1.** В этой задаче мы считаем, что кортеж (2, 1, 3) меньше кортежа (6, 4, 5), так как 1+3 < 4+6. При этом кортеж (1, 2, 9) равен кортежу (4, 5, 6), так как 1 + 9 = 4+  6.


### Решение
```python
def tuple_min_max_sum(tuple):
    min, max = tuple[0], tuple[0]
    for i in range(len(tuple)):
        if (min > tuple[i]):
            min = tuple[i]
        if (max < tuple[i]):
            max = tuple[i]
    return min + max

numbers = [(10, 10, 10), (30, 45, 56), (81, 80, 39), (1, 2, 3), (12, 45, 67), (-2, -4, 100), (1, 2, 99), (89, 90, 34), (10, 20, 30), (50, 40, 50), (34, 78, 65), (-5, 90, -1)]
print(sorted(numbers, key=tuple_min_max_sum))
```

## [Сортируй как хочешь](https://stepik.org/lesson/508939/step/13?unit=501049)
### Задание
Список `athletes` содержит сведения о спортсменах в виде кортежей: `(имя, возраст, рост, вес)`.

Напишите программу сортировки списка спортсменов по указанному полю:

-   1: по имени;
-   2: по возрасту;
-   3: по росту;
-   4: по весу.

**Формат входных данных**  
На вход программе подается натуральное число от 1 до 4 – номер поля по которому требуется отсортировать список.

**Формат выходных данных**  
Программа должна вывести отсортированный по заданному полю список в соответствии с примерами.

**Примечание.** Решите задачу **без** использования условного оператора.

### Решение
```python
def sort_by_name(tuple):
    return tuple[0]

def sort_by_age(tuple):
    return tuple[1]

def sort_by_hight(tuple):
    return tuple[2]

def sort_by_weight(tuple):
    return tuple[3]

athletes = [('Дима', 10, 130, 35), ('Тимур', 11, 135, 39), ('Руслан', 9, 140, 33), ('Рустам', 10, 128, 30), ('Амир', 16, 170, 70), ('Рома', 16, 188, 100), ('Матвей', 17, 168, 68), ('Петя', 15, 190, 90)]
sorters = [sort_by_name, sort_by_age, sort_by_hight, sort_by_weight]
n = int(input())

result = [f"{k[0]} {k[1]} {k[2]} {k[3]}" for k in sorted(athletes, key=sorters[n-1])]
print(*result, sep='\n')
```

## [Математические функции](https://stepik.org/lesson/508939/step/14?unit=501049)
### Задание
Напишите программу, которая принимает число и название функции, а выводит результат применения функции к данному числу.

Список возможных функций:
-   квадрат: функция принимает число и возвращает его квадрат;
-   куб: функция принимает число и возвращает его куб;
-   корень: функция принимает число и возвращает корень квадратный из этого числа;
-   модуль: функция принимает число и возвращает его модуль;
-   синус: функция принимает число (в радианах) и возвращает синус этого числа.

**Формат входных данных**  
На вход программе подается целое число и название функции, записанные на отдельных строках.

**Формат выходных данных**  
Программа должна выдать результат применения функции к числу.

**Примечание.** Решите задачу **без** использования условного оператора.

### Решение
```python
import math

def sqr(num):
    return num ** 2

def cube(num):
    return num ** 3

operations = {
    "квадрат": sqr,
    "куб": cube,
    "корень": math.sqrt,
    "модуль": abs,
    "синус": math.sin
}

n = int(input())
print(operations[input()](n))
```

## [Интересная сортировка-1](https://stepik.org/lesson/508939/step/15?unit=501049)
### Задание
На вход программе подается строка натуральных чисел. Из элементов строки формируется список чисел.

Напишите программу сортировки списка чисел в порядке **неубывания суммы их цифр.** При этом, если два числа имеют одинаковую сумму цифр, следует сохранить их взаиморасположение в начальном списке.

**Формат входных данных**  
На вход программе подается строка текста, содержащая натуральные числа, разделенные пробелами.

**Формат выходных данных**  
Программа должна вывести отсортированный список чисел в соответствии с условием задачи, разделяя его элементы одним пробелом.

### Решение
```python
def interesting_sort(string):
    sum = 0
    for c in string:
        sum += int(c)
    return sum

input = input().split(" ")
print(*sorted(input, key=interesting_sort))
```

## [Интересная сортировка-2](https://stepik.org/lesson/508939/step/16?unit=501049)
### Задание
На вход программе подается строка натуральных чисел. Из элементов строки формируется список чисел.

Напишите программу сортировки списка чисел в порядке неубывания суммы их цифр. При этом, если у двух чисел одинаковая сумма цифр, их следует вывести в порядке неубывания.

Формат входных данных
На вход программе подается строка текста, содержащая натуральные числа, разделенные пробелами.

Формат выходных данных
Программа должна вывести отсортированный список чисел в соответствии с условием задачи, разделяя его элементы одним пробелом.

### Решение
```python
def interesting_sort(string):
    sum = 0
    for c in string:
        sum += int(c)
    return sum

def interesting_sort2(string):
    return int(string)

input = input().split(" ")

input = sorted(input, key=interesting_sort2)
input = sorted(input, key=interesting_sort)

print(*input)
```