# 15.9 Встроенные функции any(), all(), zip(), enumerate()
## [-](https://stepik.org/lesson/511854/step/8?unit=504046)
### Задание
Функция `ignore_command()` принимает на вход один строковый аргумент `command` – команда, которую нужно проверить,

и возвращает значение `True`, если в команде содержится **подстрока** из списка `ignore` и `False` – если нет.

```python
def ignore_command(command):
    ignore = ['alias', 'configuration', 'ip', 'sql', 'select', 'update', 'exec', 'del', 'truncate']

    for word in ignore:
        if word in command:
            return True
    return False
```

Перепишите функцию `ignore_command()`, чтобы она использовала встроенные функции `all()/any()` сохранив при этом ее функционал.

### Решение
```python
def ignore_command(command):
    ignore = ['alias', 'configuration', 'ip', 'sql', 'select', 'update', 'exec', 'del', 'truncate']
    return any(map(lambda x: x in command, ignore))
```

## [-](https://stepik.org/lesson/511854/step/9?unit=504046)
### Задание
Используя параллельную итерацию сразу по трем спискам `countries, capitals` и `population` выведите информацию о стране в формате:

```1c
<capital> is the capital of <country>, population equal <population> people.


Moscow is the capital of Russia, population equal 145934462 people.
Washington is the capital of USA, population equal 331002651 people.
...
```

Для каждой страны информацию выводить на отдельной строке.

### Решение
```python
countries = ['Russia', 'USA', 'UK', 'Germany', 'France', 'India']
capitals = ['Moscow', 'Washington', 'London', 'Berlin', 'Paris', 'Delhi']
population = [145_934_462, 331_002_651, 80_345_321, 67_886_011, 65_273_511, 1_380_004_385]

for country, capital, c in zip(countries, capitals, population):
    print(f"{capital} is the capital of {country}, population equal {c} people.")
```

## [Внутри шара](https://stepik.org/lesson/511854/step/10?unit=504046)
### Задание
На вход программе подаются три строки текста с вещественными числами, значениями абсцисс (x), ординат (y) и аппликат (z) точек трехмерного пространства. Напишите программу для проверки расположения всех точек с введенными координатами внутри либо на поверхности шара с центром в начале координат и радиусом R = 2.

Формат входных данных
На вход программе подаются три строки текста с вещественными числами, разделенными символом пробела – абсциссы, ординаты и аппликаты точек в трехмерной системе координат.

Формат выходных данных
Программа должна вывести True если все точки с введенными координатами находятся внутри или на границе шара и False, если вне.

### Решение
```python
abscissas = [float(i) for i in input().split()]
ordinates = [float(i) for i in input().split()]
applicates = [float(i) for i in input().split()]

print(all(x**2 + y**2 + z**2 <= 4 for x, y, z in zip(abscissas, ordinates, applicates)))
```

## [Корректный IP-адрес](https://stepik.org/lesson/511854/step/11?unit=504046)
### Задание
IP-адрес – уникальный числовой идентификатор устройства в компьютерной сети, работающей по протоколу TCP/IP.

В 4-й версии IP-адрес представляет собой 32-битное число. Адрес записывается в виде четырёх десятичных чисел (октетов) со значением от 0 до 255 (включительно), разделённых точками, например, 192.168.1.2

Напишите программу с использованием встроенной функции `all()` для проверки корректности IP-адреса: все ли октеты в IP-адресе – числа со значением от 0 до 255.

**Формат входных данных**  
На вход программе подается строка в формате `x.x.x.x`, где `x` – непустой набор символов `0-9, a-z`.

**Формат выходных данных**  
Программа должна вывести `True` если введенная строка – корректный IP-адрес и `False` в противном случае.

### Решение
```python
print(all(i.isdigit() and 0 <= int(i) <= 255 for i in input().split(".")))
```

## [Интересные числа](https://stepik.org/lesson/511854/step/12?unit=504046)
### Задание
На вход программе подаются два натуральных числа a и b. Напишите программу с использованием встроенной функции all() для обнаружения всех целых чисел в диапазоне [a;b], которые делятся на каждую содержащуюся в них цифру без остатка.

Формат входных данных
На вход программе подаются два натуральных числа aa и bb на отдельных строках.

Формат выходных данных
Программа должна вывести все числа из диапазона [a;b], удовлетворяющие условию задачи, на одной строке, разделяя их символом пробела.

Примечание. Числа, содержащие нули, неинтересны, их выводить не нужно.

### Решение
```python
def is_interesting_number(num):
    return all(map(lambda x: x.isdigit() and x != '0' and num % int(x) == 0, str(num)))

a, b = int(input()), (int(input()))
print(*filter(lambda x: is_interesting_number(x), range(a, b+1)))
```

## [Хороший пароль](https://stepik.org/lesson/511854/step/13?unit=504046)
### Задание
Хороший пароль по условиям этой задачи состоит как минимум из 7 символов, содержит хотя бы одну цифру, заглавную и строчную букву. Напишите программу со встроенной функцией `any()` для определения хорош ли введенный пароль.

**Формат входных данных**  
На вход программе подаётся одна строка текста.

**Формат выходных данных**  
Программа должна вывести `YES`, если строка – хороший пароль, и `NO` в противном случае.

### Решение
```python
password = input()
print(["NO", "YES"][all([len(password) >= 7, any(map(lambda x: x.isdigit(), password)), any(map(lambda x: x.isupper(), password)), any(map(lambda x: x.islower(), password))])])
```

## [Отличники](https://stepik.org/lesson/511854/step/14?unit=504046)
### Задание
Учитель Тимур проверял контрольные работы по математике в нескольких классах онлайн-школы BEEGEEK и решил убедиться, что в каждом классе есть хотя бы один отличник – ученик с оценкой 5 по контрольной работе. Напишите программу с использованием встроенных функций `all(), any()` для помощи Тимуру в проверке.

**Формат входных данных**  
На вход программе подается натуральное число n – количество классов. Затем для каждого класса вводится блок информации вида:
-   натуральное число k – количество учеников в классе;
-   далее вводится k строк вида: `фамилия оценка`.

**Формат выходных данных**  
Программа должна вывести `YES`, если в каждом классе есть хотя бы один отличник, и `NO` в противном случае.

### Решение
```python
def read_data():
    groups_count = int(input())
    groups = []
    for _ in range(groups_count):
        block_count = int(input())
        block = []
        for _ in range(block_count):
            name, grade = input().split()
            block.append((name, int(grade)))
        groups.append(block)

    return groups

print(["NO", "YES"][all(map(lambda b: any(map(lambda p: p[1] == 5, b)), read_data()))])
```