# 17.2 Работа с текстовыми файлами. Часть 1
## [Содержимое файла](https://stepik.org/lesson/519125/step/11?thread=solutions&unit=511574)
### Задание
На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его содержимое.

Формат входных данных
На вход программе подается строка текста с именем существующего текстового файла.

Формат выходных данных
Программа должна вывести содержимое указанного файла.

Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.

Примечание 2. Не забудьте закрыть файл 🙂.

### Решение
```python
file = open(input())
print(*file.readlines())
file.close()
```

```python
print(*open(input()).readlines())
```

## [Предпоследняя строка](https://stepik.org/lesson/519125/step/12?unit=511574)
### Задание
На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его предпоследнюю строку.

Формат входных данных
На вход программе подается строка текста с именем существующего текстового файла.

Формат выходных данных
Программа должна вывести предпоследнюю строку указанного файла.

Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.

Примечание 2. Гарантируется, что файл содержит хотя бы две строки.

Примечание 3. Не забудьте закрыть файл 🙂.

### Решение
```python
file = open(input())
print(file.readlines()[-2])
file.close()
```

## [Случайная строка](https://stepik.org/lesson/519125/step/13?unit=511574)
### Задание
Вам доступен текстовый файл `lines.txt` из нескольких строк. Напишите программу, которая выводит на экран случайную строку из этого файла.

**Формат входных данных**  
На вход программе ничего не подается.

**Формат выходных данных**  
Программа должна вывести случайную строку указанного файла.

**Примечание 1.** Считайте, что исполняемая программа и указанный файл находятся в одной папке.

**Примечание 2.** Гарантируется, что файл содержит хотя бы одну строку.

**Примечание 3.** Не забудьте закрыть файл 🙂.

**Примечание 4.** Указанный файл можно скачать по [ссылке](https://stepik.org/media/attachments/lesson/519125/lines.txt).

### Решение
```python
from random import choice

file = open("lines.txt", encoding="UTF-8")

lines = file.readlines()
print(choice(lines))

file.close()
```

## [Сумма двух-1](https://stepik.org/lesson/519125/step/14?unit=511574)
### Задание
Вам доступен текстовый файл `numbers.txt` из двух строк, на каждой из них записано целое число. Напишите программу, выводящую на экран сумму этих чисел.

**Формат входных данных**  
На вход программе ничего не подается.

**Формат выходных данных**  
Программа должна вывести сумму чисел из указанного файла.

**Примечание 1.** Считайте, что исполняемая программа и указанный файл находятся в одной папке.

**Примечание 2.** Не забудьте закрыть файл 🙂.

**Примечание 3.** Указанный файл можно скачать по [ссылке](https://stepik.org/media/attachments/lesson/519125/numbers.txt).

### Решение
```python
file = open("numbers.txt", encoding="UTF-8")

print(sum([int(i) for i in file.readlines()]))

file.close()
```

## [Сумма двух-2](https://stepik.org/lesson/519125/step/15?unit=511574)
### Задание
Вам доступен текстовый файл `nums.txt`. В файле записано два целых числа, они могут быть разделены символами пробела и конца строки. Напишите программу, выводящую на экран сумму этих чисел.

**Формат входных данных**  
На вход программе ничего не подается.

**Формат выходных данных**  
Программа должна вывести сумму чисел из указанного файла.

**Примечание 1.** Считайте, что исполняемая программа и указанный файл находятся в одной папке.

**Примечание 2.** Не забудьте закрыть файл 🙂.

**Примечание 3.** Указанный файл можно скачать по [ссылке](https://stepik.org/media/attachments/lesson/519125/nums.txt).

### Решение
```python
file = open("nums.txt", encoding="UTF-8")

print(sum([int(i) for i in file.read().split()]))

file.close()
```

## [Общая стоимость](https://stepik.org/lesson/519125/step/16?unit=511574)
### Задание
Вам доступен текстовый файл `prices.txt` с информацией о заказе из интернет магазина. В нем каждая строка с помощью символа табуляции (`\t`) разделена на три колонки:

1.  наименование товара;
2.  количество товара (целое число);
3.  цена (в рублях) товара за 11 шт (целое число).

Напишите программу, выводящую на экран общую стоимость заказа.

**Формат входных данных**  
На вход программе ничего не подается.

**Формат выходных данных**  
Программа должна вывести общую стоимость заказа.

**Примечание 1.** Считайте, что исполняемая программа и указанный файл находятся в одной папке.

**Примечание 2.** Не забудьте закрыть файл 🙂.

**Примечание 3.** Указанный файл можно скачать по [ссылке](https://stepik.org/media/attachments/lesson/519125/prices.txt).

### Решение
```python
from functools import reduce

file = open("prices.txt", encoding="UTF-8")

things = [tuple(i.rstrip().split('\t')) for i in file.readlines()]
result = reduce(lambda x, y: x + int(y[1]) * int(y[2]), things, 0)
print(result)

file.close()
```
